//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/
//! @file   Cloud.cpp
//!
//! @brief  Cloudクラスの定義
//!
//! @date   2016.09.09
//!
//! @author Miyu Hara
//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/

/* インクルードファイル */
#include "Cloud.h"


/* クラスの定義 */
/* --------------------------------------------------------
関数名：Cloud::Cloud
概要　：Cloudクラスのコンストラクタ
引数　：幅(int)、高さ(int)、座標Ｘ(float)、座標Ｙ(float)
		速度Ｘ(float)、座標Ｙ(float)
戻り値：なし
-------------------------------------------------------- */
Cloud::Cloud(int w, int h, float px, float py, float sx, float sy)
	: Object(w, h, px, py, sx, sy)
{}

/* --------------------------------------------------------
関数名：Cloud::Update
概要　：更新処理
引数　：なし(void)
戻り値：なし(void)
-------------------------------------------------------- */
void Cloud::Update(void)
{
	// 移動処理
	pos_x -= spd_x;
	if (GetRightBorder() < 0.0f)
	{
		pos_x = 640.0f;				// SCREEN_WIDTH
	}
}
